[
  {
    "description": "**Join us, be part of more.**\n We’re so much more than an energy company. We’re a family of brands revolutionising how we power the planet. We're energisers. One team of 21,000 colleagues that's energising a greener, fairer future by creating an energy system that doesn’t rely on fossil fuels, whilst living our powerful commitment to igniting positive change in our communities. Here, you can find more purpose, more passion, and more potential. That’s why working here is \\#MoreThanACareer. We do energy differently \\- we do it all. We make it, store it, move it, sell it, and mend it.\n   \n\n  \n\n  \n\n  \n\n**About your team:**\n At Centrica Business Solutions, we’re proud to partner with over 7,000 organisations globally – helping them to balance planet, with profit. We build, operate and maintain onsite, large\\-scale energy assets like Solar PV and Combined Heat and Power – to help businesses to save the planet and save money. We’re also transforming the UK’s energy landscape by partnering with landowners and developers to build a 900MW portfolio of new grid\\-scale solar farms and battery storage assets.\n   \n\n  \n\n Centrica Business Solutions is a leader in the decentralized energy market, active in the United Kingdom, Europe, North America and other markets. With price predictability a thing of the past, and supply volatility and new energy technologies taking over, we are using our energy expertise to help our customers become environmentally friendly and economically sustainable. Our mission is to build a sustainable power grid, striving to carbon neutrality and halting climate change.\n   \n\n  \n\n**About The Role**\n As part of an agile development team, you will develop on the CBS optimization software platform (FlexPond) providing energy services to customers of Centrica Business Solutions and Utility SaaS customers.\n   \n\n  \n\n The focus of this mission is on the settlement process improvement of the FlexPond demand\\-response platform, which timeseries and contractual data processing. The mission also gives the opportunity to learn about the challenging power grid rules, regulations and processes regarding ancillary services and wholesale markets.\n   \n\n  \n\n Key Accountabilities\n   \n\n  \n\n* Elaboration, design, and development of settlement processes in close collaboration with the product manager and the business stakeholders\n* Improvement and creation of settlement\\-related services and data\\-validation\n* Operational support of the settlement back\\-office team\n\n\n The technology team is in Antwerp\\-Berchem (Belgium) at a walking distance from the train station.\n   \n\n  \n\n We offer\n   \n\n  \n\n* An (at least) 6\\-month contractor mission as part of a team of top developers building a world\\-leading distributed energy optimization platform\n* An opportunity to work as part of a team focusing on decarbonizing the power grid\n* Flexible working hours and 3 days/week home working opportunity\n* An international company with the opportunity to travel to other offices from time to time\n\n\n**About You**\n The ideal profile combines technical excellence with a strong business mindset. A natural curiosity and eagerness to understand the business context drive thoughtful and effective software design. With a broad interest in technology and a fast\\-learning attitude, this person thrives in dynamic environments and adapts quickly to new tools and challenges.\n   \n\n  \n\n The ideal candidate will have:\n   \n\n  \n\n* A Master’s degree in a relevant field (e.g., IT, science, mathematics, engineering) or equivalent experience demonstrated through a strong professional track record.\n* A minimum of 3 years of hands\\-on experience in professional Python development.\n* Practical experience as a Python data engineer or data analyst, with proficiency in tools such as NumPy, pandas, Jupyter Notebook, and SQL.\n* Familiarity with containerization and orchestration technologies, including Docker and Kubernetes.\n* Experience working with gRPC and microservice\\-based architectures.\n\n\n It is an advantage but not a requirement if you have experience with .NET / C\\#.\n   \n\n  \n\n**Why should you apply?** \n  \n\n  \n\n  \n\n  \n\n We’re not a perfect place – but we’re a people place. Our priority is supporting all of the different realities our people face. Life is about so much more than work. We get it. That’s why we’ve designed our total rewards to give you the flexibility to choose what you need, when you need it, making sure that you and your family are supported not only financially, but physically and emotionally too. Visit the link below to discover why we’re a great place to work and what being part of more means for you.\n   \n\n  \n\n  \n\n  \n\n https://www.morethanacareer.energy/cbs\n   \n\n  \n\n  \n\n  \n\n If you're full of energy, fired up about sustainability, and ready to craft not only a better tomorrow, but a better you, then come and find your purpose in a team where your voice matters, your growth is non\\-negotiable, and your ambitions are our priority.\n   \n\n  \n\n  \n\n  \n\n Help us, help you. We would love for you to share any information about yourself throughout our recruitment process so that we can better understand you and help shape your journey.",
    "hard_skills": [
      "Python",
      "NumPy",
      "pandas",
      "Jupyter Notebook",
      "SQL",
      "Docker",
      "Kubernetes",
      "gRPC",
      "microservice-based architectures"
    ],
    "soft_skills": [
      "Curiosity",
      "Business mindset",
      "Adaptability",
      "Fast learning"
    ]
  },
  {
    "description": "**Job Title:** \n Data Platform Engineers\n \n\n\n\n**Location** \n : Brussels, Belgium\n \n\n\n\n**Duration** \n : 3 Months with extension\n \n\n\n\n**Languages** \n : Dutch or French and English\n \n\n\n\n**Work mode** \n : Hybrid\n \n\n\n\n  \n\n\n\n\n\n**Job Description:** \n\n\n\n* You are primarily responsible for the development and management of a modern, holistic data platform built in the Microsoft Azure cloud. Furthermore, as an IT Custodian, you are a key member of the \"Data Platform\" team, ensuring the design, implementation, and advanced optimization of the big data processing pipeline it contains.\n* Within the Data Platform team, you are responsible for the following aspects:\n* You mainly work on the processing and transformation of the platform's generic data, focusing on the collection, integration, storage, and logic from various data sources at the client office.\n* You perform data analyses, modeling, and collaborate with Data Scientists to scale up machine learning models and algorithms, or in the context of advanced and ad\\-hoc analytics.\n* You are responsible for optimizing performance issues and maintaining the platform to ensure optimal operation.\n* Because you hold a Bachelor's or Master's degree in Data Science or a related field involving big data, and you have at least 5 years of experience with data pipelines, cloud technologies, and strong skills in data modeling and data warehousing.\n\n\n\n  \n\n\n\n\n\n**Because you are familiar with the following technologies or concepts:** \n\n\n\n* Apache Spark, Python, notebooks\n* Azure DevOps CI/CD pipelines\n* Microsoft SQL or DBT\n* Azure Data Platform Stack, including:\n\n\n1. Synapse Analytics\n2. Lakehouse\n3. Fabric\n4. Semantic Model\n5. Power BI\n\n\n* Experience with cloud computing, data engineering, big data processing, performance tuning\n* Azure Data Platform architecture\n\n\n\n  \n\n\n\n\n\n**Three reasons why this position is for you:** \n\n\n\n1. You are an expert in Azure data platforms, experienced with Azure \\& Fabric technology, and skilled in data pipeline performance and optimization.\n2. You are familiar with DevOps methodology, which you will apply in your daily tasks.\n3. You are naturally analytical and enjoy solving complex problems.\n\n\n\n  \n\n\n\n\n\n**Roles** \n\n\n\n* ConfirmedData Engineer (ETL/ ELT)\n\n\n\n  \n\n\n\n\n\n**Skills** \n\n\n\n* Apache Spark\n* Azure DevOps\n* CI/CD pipelines\n* Microsoft SQL\n* Power BI\n* Python",
    "hard_skills": [
      "Apache Spark",
      "Python",
      "Azure DevOps",
      "CI/CD pipelines",
      "Microsoft SQL",
      "Azure Data Platform Stack (Synapse Analytics, Lakehouse, Fabric, Semantic Model)",
      "Data Engineering",
      "Big Data Processing",
      "Performance Tuning"
    ],
    "soft_skills": [
      "Analytical"
    ]
  },
  {
    "description": "**🐼 Who we are**\n**You. Better. With Alan.**\n Alan's vision is to make prevention the new norm of care for all.\n **Our mission is to help people live in good health to 100 while helping employers feel proud, turning health benefits from a cost centre into their most valuable investment.**\n We're building a\n **vertically integrated health partner** \n that seamlessly unites insurance and smart healthcare delivery into one system.\n   \n\n  \n\n By connecting all aspects of care \\- private, public, and direct to consumer \\-\n **we create the most member\\-centric healthcare experience.** \n Through deep engagement, we empower everyone to overcome day\\-to\\-day health obstacles and live healthier lives.\n   \n\n  \n\n We partner with\n **32,000\\+ companies** \n of all sizes, serving more than\n **700K members** \n , and have reached\n **€500M\\+** \n in ARR.\n   \n\n  \n\n Our team of\n **600 people** \n (still growing) operates across\n **France 🇫🇷, Spain 🇪🇸, Belgium 🇧🇪, and Canada 🇨🇦.**\n**🤘 How we do it ?**\n**About**\n People joining Alan are often surprised and delighted by our innovative working method. We have a set of cultural values that guide our approach to work, such as:\n   \n\n  \n\n* **Mission is the Boss:** \n We have a mission\\-first focus with long\\-term thinking, where all employees act as owners seeking the company's success above all else.\n* **Member \\& Customer\\-led:** \n We are obsessively focused on solving customer problems and creating delightful experiences while building trust.\n* **Excellence like Athletes:** \n We maintain high standards and talent density, using the Keeper Test to ensure exceptional performance.\n* **Enlightened Despots:** \n We combine distributed ownership with accountability, empowering decision\\-makers while maintaining responsibility.\n* **Radically Transparent:** \n We make information accessible and written\\-first, promoting async communication while protecting sensitive data.\n* **Kind, Methodic Optimists:** \n We collaborate genuinely without ego, support teammates, and maintain positive intent while assuming the best.\n* **Empathetic Challengers:** \n We give direct feedback with empathy, praise strengths, and focus on growth through candid communication.\n* **Bold \\& Creative Contrarians:** \n We think differently to achieve greatness, challenge expertise with first principles, and embrace calculated risks.\n* **Disciplined Executors:** \n We focus on making good decisions quickly, maintain accountability, and break down problems into manageable pieces.\n* **Fight for Simplicity** \n : We eliminate unnecessary processes, stay concise and articulate, and maintain smart frugality while solving problems pragmatically.\n\n\n**⭐ The Engineering team ⭐**\n In our engineering team, we build the infrastructure, interfaces, and applications to provide first\\-class service to our members, health professionals, and even ourselves!\n   \n\n  \n\n Being an engineer at Alan means joining a team of talented, committed and passionate engineers, with a lot of product interaction.\n   \n\n  \n\n We move fast, with a lot of ownership, and are proud to tackle big problems!\n   \n\n  \n\n We do security as we do everything else — that is, not quite the traditional way, but always in line with our leadership principles.\n   \n\n  \n\n Joining Alan as a Security Software Engineer team means you're at the forefront of protecting sensitive health data and ensuring our systems are resilient against threats.\n   \n\n  \n\n Want to know more? Read this article on our Engineering career path.\n   \n\n  \n\n 🤖 The Tech Foundations area\n   \n\n  \n\n 🎯\n **Mission** \n : Tech Foundations enables Product Crews to experiment and ship product increments quickly, fostering product quality and reliability with security as a nonnegotiable attribute.\n   \n\n  \n\n**🔭 Scope:**\n* Infrastructure enablement for product crews (e.g. hosting improvements, CI/CD, ...)\n* Security and compliance facilitation (e.g. authentication, database anonymization...)\n* Developer productivity enhancements (e.g. local environment setup, monorepo tooling, custom CLI and dashboards ...)\n* Design and development unification (e.g. Design System, ...)\n\n\n**👀 Focus for 2025:**\n*(You can learn about some of the things* \n*we did in 2024 in this blogpost)*\n In 2025, we will grow the team significantly to further increase our impact. We want to improve the quality of our foundations, from Infrastructure to code foundations (backend/frontend/mobile). We also have ambitions around our Security stack and enhanced tools and processes for developers.\n   \n\n  \n\n**🔄 A quick note about the process:**\n While you’re applying for a particular area, please note that you may ultimately join a different part of our engineering organization, depending on where we believe you will have the most impact.\n   \n\n  \n\n ⭐️\n **Is it you we’re looking for?** \n ⭐️\n   \n\n  \n\n We are looking for experienced Security Engineers to help us strengthen our security posture across our engineering organization:\n   \n\n  \n\n* Strong background in application and infrastructure security. Application Security Testing and Penetration Testing are not just buzzwords for you, you have hands\\-on experience using these techniques to identify and mitigate security vulnerabilities in web and mobile applications.\n* Experience in protecting organisations from cyber threats and have experience working with platforms to monitor, detect, and respond to security incidents.\n* Passionate about building secure products and systems.\n* Familiarity with cloud security and modern web application security\n\n\n You would be a good fit at Alan if most of this sounds like you:\n   \n\n  \n\n* Well\\-versed in Object Oriented Programming such as Python, Java, C\\#, and enthusiastic about web technologies such as modern JavaScript.\n* Willing to work in Python/JavaScript (but you don’t need to have experience with those 2 languages!).\n* Passionate about building products.\n* Self\\-starting and entrepreneurial.\n* Humble and still willing to grow (no matter your seniority!).\n* Collaborative, enthusiastic about teamwork, learning, and teaching.\n* Fluent in English (no need to speak French!).\n\n\n For this opportunity, we are aiming to hire within the D\\-F level range.\n   \n\n  \n\n But above all, we are looking for high potential and curiosity: make sure to show us this when you apply! Everything else is a bonus.\n   \n\n  \n\n 🙌 Perks \\& Benefits\n   \n\n  \n\n At Alan, we believe that\n **being in good health is a basic need** \n , and it starts with our employees. This is why Alaners are provided with a stimulating environment and perks ensuring they are\n **happy, efficient and spend only high\\-quality time** \n with co\\-workers.\n   \n\n  \n\n**Therefore, we offer:**\n* **Fair rewards** \n . Generous equity packages complement your base salary, for permanent contracts only.\n* **Flexible Office** \n . Amazing office space at our HQ, sponsored co\\-working hubs or a full\\-remote experience with home office equipment sponsorship, we want you to live where you’re the happiest.\n* **All the tools you need** \n . Top of the range equipment: Macbook Pro, keyboard, laptop stand, monitor, and Bose noise\\-canceling headphones.\n* **Flexible vacation policy and flexible working hours** \n . Organize your time as you wish.\n* **Delightful healthcare insurance:** \n Extremely comprehensive health insurance \\- 100% for you and your children, 90\\-100% for partners depending on your country (permanent contracts only).\n* **Transport** \n . Country\\-specific commuter benefits.\n* **Learning \\& Training opportunities** \n . A highly flexible Training policy free books and budget to attend and speak at conferences if the opportunity arises.\n* **Personal growth through coaching** \n : At Alan, coaching isn't just a perk \\-\n \n it's core to who we are. Every Alaner is paired with a dedicated coach from day one, who helps maximize their impact, nurture engagement, and navigate Alan's values to develop their full potential.\n \n**Learn more about our coaching culture** \n**.**\n* **Parental leave** \n . Extended parental leave for all new parents, for permanent contracts only.",
    "hard_skills": [
      "Python",
      "Java",
      "C#",
      "Object Oriented Programming",
      "Application Security Testing",
      "Penetration Testing",
      "Cloud security",
      "Modern JavaScript"
    ],
    "soft_skills": [
      "Mission-first focus",
      "Customer-led",
      "Excellence like Athletes",
      "Enlightened Despots",
      "Radically Transparent",
      "Kind, Methodic Optimists",
      "Empathetic Challengers",
      "Bold & Creative Contrarians",
      "Disciplined Executors",
      "Fight for Simplicity",
      "Self-starting",
      "Entrepreneurial",
      "Humble",
      "Collaborative",
      "Fluent in English"
    ]
  },
  {
    "description": "**Job Title: Data Engineer** \n\n\n\n\n**Location: Brussels, Belgium** \n\n\n\n\n**Duration: 3 Months** \n\n\n\n\n**Language: English, Dutch OR French** \n\n\n\n\n**Work Mode: Onsite** \n\n\n\n\n  \n\n\n\n\n\n**Job Description** \n\n\n\n\n  \n\n\n\n\n\n**What is your mission?** \n\n\n\n* You are primarily responsible for the development and management of a modern, holistic data platform built in the Microsoft Azure cloud. Furthermore, as an IT Custodian, you are a key member of the \"Data Platform\" team, ensuring the design, implementation, and advanced optimization of the big data processing pipeline it contains.\n\n\n\n**Within the Data Platform team, you are responsible for the following aspects:** \n\n\n\n* You mainly work on the processing and transformation of the platform's generic data, focusing on the collection, integration, storage, and logic from various data sources at the Client.\n* You perform data analyses, modeling, and collaborate with Data Scientists to scale up machine learning models and algorithms, or in the context of advanced and ad\\-hoc analytics.\n* You are responsible for optimizing performance issues and maintaining the platform to ensure optimal operation.\n\n\n\n**Why can you make a difference?** \n\n\n\n* Because you hold a Bachelor's or Master's degree in Data Science or a related field involving big data, and you have at least 5 years of experience with data pipelines, cloud technologies, and strong skills in data modeling and data warehousing.\n\n\n\n**Because you are familiar with the following technologies or concepts:** \n\n\n\n* Apache Spark, Python, notebooks\n* Azure DevOps CI/CD pipelines\n* Microsoft SQL or DBT\n* Azure Data Platform Stack, including:\n* Synapse Analytics\n* Lakehouse\n* Fabric\n* Semantic Model\n* Power BI",
    "hard_skills": [
      "Apache Spark",
      "Python",
      "Notebooks",
      "Azure DevOps CI/CD pipelines",
      "Microsoft SQL",
      "DBT",
      "Azure Data Platform Stack",
      "Synapse Analytics",
      "Lakehouse",
      "Fabric",
      "Semantic Model",
      "Power BI"
    ],
    "soft_skills": [
      "Data Science",
      "Big data",
      "Data pipelines",
      "Data modeling",
      "Data warehousing",
      "5 years of experience"
    ]
  },
  {
    "description": "**Vacature: Senior Azure Data Engineer**\n**Regio Antwerpen \\- hybride** \n\n\n\n\n Voor een toonaangevende organisatie in volle digitale transformatie zijn wij op zoek naar een ervaren\n **Azure Data Engineer** \n . Je maakt deel uit van een groeiend Data \\& AI\\-team en werkt aan de opbouw van een moderne dataomgeving gebaseerd op\n **Azure Databricks** \n . In deze rol krijg je zowel strategische als technische verantwoordelijkheid in het realiseren van schaalbare, veilige en performante data\\-oplossingen.\n \n\n\n\n**Wat ga je doen?** \n\n\n\n* Integreren van databronnen via\n **APIs, ODBC, Event Hubs, sFTP**\n* Ontwikkelen van\n **ETL/ELT pipelines** \n met Azure Data Factory \\& Databricks\n* Toepassen van\n **Medallion Architecture** \n (Bronze, Silver, Gold)\n* Bouwen van datamodellen (star schema's, SCD's) voor analyse \\& operationele rapportering\n* Zorgen voor een veilige dataomgeving via\n **RBAC** \n en\n **Unity Catalog**\n* Optimaliseren van pipelines en implementeren van\n **CI/CD** \n via Azure DevOps\n* Samenwerken met data scientists, IT\\-collega's en business stakeholders\n* Meewerken aan strategische projecten rond digitalisering, AI en data\\-integratie\n\n\n\n**Wat breng je mee?** \n\n\n\n* Minstens\n **5 jaar ervaring** \n als Azure Data Engineer of gelijkaardige rol\n* Grondige kennis van\n **Azure Data Factory** \n ,\n **Databricks** \n en\n **Azure Storage**\n* Sterke skills in\n **SQL** \n ,\n **Python** \n en datamodellering\n* Ervaring met formaten zoals\n **Parquet** \n en\n **JSON**\n* Bekendheid met AI/ML\\-integraties op Databricks is een troef\n* Bachelor of Master in IT, Computerwetenschappen of gelijkaardig\n* **Microsoft Certified: Azure Data Engineer Associate**\n* Talen:\n **vloeiend Nederlands en Engels** \n (Frans is een plus)\n* Kennis van\n **Power BI** \n is mooi meegenomen\n\n\n\n**Wat typeert jou?** \n\n\n\n* Analytisch sterk \\& detailgericht\n* Klant\\- en resultaatgericht\n* Sterk in samenwerking en communicatie\n* Passie voor innovatie en technologie\n\n\n\n**Wat mag je verwachten?** \n\n\n\n* Een uitdagende en veelzijdige\n **voltijdse functie** \n met veel verantwoordelijkheid\n* Een organisatie in volle groei waar\n **mensen en initiatief centraal staan**\n* Tal van opleidingskansen en ruimte voor persoonlijke ontwikkeling\n* **Aantrekkelijk loonpakket** \n met uitgebreide extra\\-legale voordelen\n* **Hybride werkregeling** \n : moderne werkplek in regio Antwerpen \\+ 2 dagen thuiswerk\n* 40\\-urenweek met\n **12 ADV\\-dagen extra verlof**\n* Werken in een vooruitstrevend team met sterke collegialiteit en kennisdeling\n\n\n\n**Interesse?**\n Stuur je cv of neem contact op voor meer info. We bekijken graag samen of dit een goede match kan zijn!",
    "hard_skills": [
      "APIs",
      "ODBC",
      "Event Hubs",
      "sFTP",
      "ETL/ELT pipelines",
      "Azure Data Factory",
      "Databricks",
      "Azure Storage",
      "SQL",
      "Python",
      "Parquet",
      "JSON",
      "Medallion Architecture",
      "RBAC",
      "Unity Catalog",
      "CI/CD",
      "Azure DevOps",
      "Power BI"
    ],
    "soft_skills": [
      "Analytical",
      "Detailed",
      "Client-oriented",
      "Result-driven",
      "Collaborative",
      "Communicative",
      "Passionate for innovation and technology"
    ]
  }
]